Revit 2027 API
ParameterTypeId.SteelElemWeldMainWeldprep Property
 "Main Weld preparation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldMainWeldprep { get; }
Public Shared ReadOnly Property SteelElemWeldMainWeldprep As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldMainWeldprep {
	ForgeTypeId^ get ();
}
static member SteelElemWeldMainWeldprep : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace